nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define CLKCTL3_PSCCTL0_COMP_CLR_OSTIMER_MASK    (0x80U)
#define CLKCTL3_PSCCTL0_COMP_CLR_OSTIMER_SHIFT   (7U)
/*! OSTIMER - OSTIMER Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_OSTIMER(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_OSTIMER_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_OSTIMER_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_SEMA42_0_MASK   (0x100U)
#define CLKCTL3_PSCCTL0_COMP_CLR_SEMA42_0_SHIFT  (8U)
/*! SEMA42_0 - SEMA42_0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_SEMA42_0(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_SEMA42_0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_SEMA42_0_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_SDADC0_MASK     (0x200U)
#define CLKCTL3_PSCCTL0_COMP_CLR_SDADC0_SHIFT    (9U)
/*! SDADC0 - SDADC0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_SDADC0(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_SDADC0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_SDADC0_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_SARADC0_MASK    (0x400U)
#define CLKCTL3_PSCCTL0_COMP_CLR_SARADC0_SHIFT   (10U)
/*! SARADC0 - ADC0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_SARADC0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_SARADC0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_SARADC0_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_ACMP0_MASK      (0x800U)
#define CLKCTL3_PSCCTL0_COMP_CLR_ACMP0_SHIFT     (11U)
/*! ACMP0 - ACMP0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_ACMP0(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_ACMP0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_ACMP0_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_MICFIL_MASK     (0x1000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_MICFIL_SHIFT    (12U)
/*! MICFIL - MICFIL Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_MICFIL(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_MICFIL_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_MICFIL_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY4_MASK    (0x2000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY4_SHIFT   (13U)
/*! GLIKEY4 - GLIKEY4 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY4(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY4_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY4_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_DBG_RT700_MASK  (0x100000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_DBG_RT700_SHIFT (20U)
/*! DBG_RT700 - DBG_RT700 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_DBG_RT700(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_DBG_RT700_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_DBG_RT700_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_SYSCON3_MASK    (0x200000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_SYSCON3_SHIFT   (21U)
/*! SYSCON3 - SYSCON3 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_SYSCON3(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_SYSCON3_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_SYSCON3_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_IOPCTL1_MASK    (0x400000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_IOPCTL1_SHIFT   (22U)
/*! IOPCTL1 - IOPCTL1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_IOPCTL1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_IOPCTL1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_IOPCTL1_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY1_MASK    (0x800000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY1_SHIFT   (23U)
/*! GLIKEY1 - GLIKEY1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_GLIKEY1_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_LPI2C15_MASK    (0x1000000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_LPI2C15_SHIFT   (24U)
/*! LPI2C15 - LPI2C15 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_LPI2C15(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_LPI2C15_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_LPI2C15_MASK)

#define CLKCTL3_PSCCTL0_COMP_CLR_MEDIA_ACCESS_RAM_ARBITER1_MASK (0x2000000U)
#define CLKCTL3_PSCCTL0_COMP_CLR_MEDIA_ACCESS_RAM_ARBITER1_SHIFT (25U)
/*! MEDIA_ACCESS_RAM_ARBITER1 - Media Access RAM Arbiter1 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL3_PSCCTL0_COMP_CLR_MEDIA_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CLR_MEDIA_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CLR_MEDIA_ACCESS_RAM_ARBITER1_MASK)
/*! @} */

/*! @name ONE_SRC_CLKSLICE_ENABLE_COMP - One Source Clock Slice Enable for VDD2_COMP CPU */
/*! @{ */

#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_RTC_FCLK_EN_MASK (0x1U)
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_RTC_FCLK_EN_SHIFT (0U)
/*! RTC_FCLK_EN - RTC Functional Clock Gating Enable
 *  0b0..Gates RTC functional clock.
 *  0b1..Enables RTC functional clock.
 */
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_RTC_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_RTC_FCLK_EN_SHIFT)) & CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_RTC_FCLK_EN_MASK)

#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET2_FCLK_EN_MASK (0x2U)
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET2_FCLK_EN_SHIFT (1U)
/*! dGDET2_FCLK_EN - dGDET2 Functional Clock Gating Enable
 *  0b0..Gates dGDET2 functional clock.
 *  0b1..Enables dGDET2 functional clock.
 */
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET2_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET2_FCLK_EN_SHIFT)) & CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET2_FCLK_EN_MASK)

#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET3_FCLK_EN_MASK (0x4U)
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET3_FCLK_EN_SHIFT (2U)
/*! dGDET3_FCLK_EN - dGDET3 Functional Clock Gating Enable
 *  0b0..Gates dGDET3 functional clock.
 *  0b1..Enables dGDET3 functional clock.
 */
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET3_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET3_FCLK_EN_SHIFT)) & CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_COMP_DGDET3_FCLK_EN_MASK)
/*! @} */

