nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define CLKCTL3_PSCCTL0_SENS_CLR_GLIKEY1_MASK    (0x800000U)
#define CLKCTL3_PSCCTL0_SENS_CLR_GLIKEY1_SHIFT   (23U)
/*! GLIKEY1 - GLIKEY1 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL3_PSCCTL0_SENS_CLR_GLIKEY1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_CLR_GLIKEY1_SHIFT)) & CLKCTL3_PSCCTL0_SENS_CLR_GLIKEY1_MASK)

#define CLKCTL3_PSCCTL0_SENS_CLR_LPI2C15_MASK    (0x1000000U)
#define CLKCTL3_PSCCTL0_SENS_CLR_LPI2C15_SHIFT   (24U)
/*! LPI2C15 - LPI2C15 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL3_PSCCTL0_SENS_CLR_LPI2C15(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_CLR_LPI2C15_SHIFT)) & CLKCTL3_PSCCTL0_SENS_CLR_LPI2C15_MASK)

#define CLKCTL3_PSCCTL0_SENS_CLR_MEDIA_ACCESS_RAM_ARBITER1_MASK (0x2000000U)
#define CLKCTL3_PSCCTL0_SENS_CLR_MEDIA_ACCESS_RAM_ARBITER1_SHIFT (25U)
/*! MEDIA_ACCESS_RAM_ARBITER1 - Media Access RAM Arbiter1 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL3_PSCCTL0_SENS_CLR_MEDIA_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_SENS_CLR_MEDIA_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL3_PSCCTL0_SENS_CLR_MEDIA_ACCESS_RAM_ARBITER1_MASK)
/*! @} */

/*! @name ONE_SRC_CLKSLICE_ENABLE_SENSE - One Source Clock Slice Enable for VDD1_SENSE CPU */
/*! @{ */

#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_RTC_FCLK_EN_MASK (0x1U)
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_RTC_FCLK_EN_SHIFT (0U)
/*! RTC_FCLK_EN - RTC Functional Clock Gating Enable
 *  0b0..Gates RTC functional clock.
 *  0b1..Enables RTC functional clock.
 */
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_RTC_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_RTC_FCLK_EN_SHIFT)) & CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_RTC_FCLK_EN_MASK)

#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET2_FCLK_EN_MASK (0x2U)
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET2_FCLK_EN_SHIFT (1U)
/*! dGDET2_FCLK_EN - dGDET2 Functional Clock Enable
 *  0b0..Gates dGDET2 functional clock.
 *  0b1..Enables dGDET2 functional clock.
 */
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET2_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET2_FCLK_EN_SHIFT)) & CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET2_FCLK_EN_MASK)

#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET3_FCLK_EN_MASK (0x4U)
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET3_FCLK_EN_SHIFT (2U)
/*! dGDET3_FCLK_EN - dGDET3 Functional Clock Enable
 *  0b0..Gates dGDET3 functional clock.
 *  0b1..Enables dGDET3 functional clock.
 */
#define CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET3_FCLK_EN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET3_FCLK_EN_SHIFT)) & CLKCTL3_ONE_SRC_CLKSLICE_ENABLE_SENSE_DGDET3_FCLK_EN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CLKCTL3_Register_Masks */


/* CLKCTL3 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CLKCTL3 base address */
  #define CLKCTL3_BASE                             (0x50061000u)
  /** Peripheral CLKCTL3 base address */
  #define CLKCTL3_BASE_NS                          (0x40061000u)
  /** Peripheral CLKCTL3 base pointer */
  #define CLKCTL3                                  ((CLKCTL3_Type *)CLKCTL3_BASE)
  /** Peripheral CLKCTL3 base pointer */
  #define CLKCTL3_NS                               ((CLKCTL3_Type *)CLKCTL3_BASE_NS)
  /** Array initializer of CLKCTL3 peripheral base addresses */
  #define CLKCTL3_BASE_ADDRS                       { CLKCTL3_BASE }
  /** Array initializer of CLKCTL3 peripheral base pointers */
  #define CLKCTL3_BASE_PTRS                        { CLKCTL3 }
  /** Array initializer of CLKCTL3 peripheral base addresses */
  #define CLKCTL3_BASE_ADDRS_NS                    { CLKCTL3_BASE_NS }
  /** Array initializer of CLKCTL3 peripheral base pointers */
  #define CLKCTL3_BASE_PTRS_NS                     { CLKCTL3_NS }
#else
  /** Peripheral CLKCTL3 base address */
  #define CLKCTL3_BASE                             (0x40061000u)
  /** Peripheral CLKCTL3 base pointer */
  #define CLKCTL3                                  ((CLKCTL3_Type *)CLKCTL3_BASE)
  /** Array initializer of CLKCTL3 peripheral base addresses */
  #define CLKCTL3_BASE_ADDRS                       { CLKCTL3_BASE }
  /** Array initializer of CLKCTL3 peripheral base pointers */
  #define CLKCTL3_BASE_PTRS                        { CLKCTL3 }
#endif

/*!
 * @}
 */ /* end of group CLKCTL3_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CLKCTL4 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL4_Peripheral_Access_Layer CLKCTL4 Peripheral Access Layer
 * @{
 */

/** CLKCTL4 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PSCCTL0_MEDIA;                     /**< VDD2_COMP Media Peripheral Clock Control 0, offset: 0x10 */
  __IO uint32_t PSCCTL1_MEDIA;                     /**< VDD2_COMP Media Peripheral Clock Control 1, offset: 0x14 */
       uint8_t RESERVED_1[40];
  __IO uint32_t PSCCTL0_MEDIA_SET;                 /**< VDD2_COMP Media Peripheral Clock Control 0 Set, offset: 0x40 */
  __IO uint32_t PSCCTL1_MEDIA_SET;                 /**< VDD2_COMP Media Peripheral Clock Control 1 Set, offset: 0x44 */
       uint8_t RESERVED_2[40];
  __IO uint32_t PSCCTL0_MEDIA_CLR;                 /**< VDD2_COMP Media Peripheral Clock Control 0 Clear, offset: 0x70 */
  __IO uint32_t PSCCTL1_MEDIA_CLR;                 /**< VDD2_COMP Media Peripheral Clock Control 1 Clear, offset: 0x74 */
       uint8_t RESERVED_3[24];
  __IO uint32_t ONE_SRC_CLKSLICE_ENABLE;           /**< One Source Clock Slice Enable for VDD2_COMP Core, offset: 0x90 */
       uint8_t RESERVED_4[16];
  __IO uint32_t MEDIAVDDNCLKSEL;                   /**< VDDN_MEDIA Clock Source Select, offset: 0xA4 */
       uint8_t RESERVED_5[4];
  __IO uint32_t MEDIAVDDNCLKDIV;                   /**< VDDN_MEDIA Clock Divider, offset: 0xAC */
       uint8_t RESERVED_6[84];
  __IO uint32_t MEDIAMAINCLKSEL;                   /**< Media Main Clock Source Select, offset: 0x104 */
       uint8_t RESERVED_7[4];
  __IO uint32_t MEDIAMAINCLKDIV;                   /**< Media Main Clock Divider, offset: 0x10C */
  __IO uint32_t MDNBASECLKSEL;                     /**< VDDN_MEDIA Base Clock Source Select, offset: 0x110 */
  __IO uint32_t MD2BASECLKSEL;                     /**< VDD2_MEDIA Base Clock Source Select, offset: 0x114 */
       uint8_t RESERVED_8[232];
  __IO uint32_t XSPI2FCLKSEL;                      /**< XSPI2 Functional Clock Source Select, offset: 0x200 */
  __IO uint32_t XSPI2FCLKDIV;                      /**< XSPI2 Functional Clock Divider, offset: 0x204 */
       uint8_t RESERVED_9[24];
  __IO uint32_t USBFCLKSEL;                        /**< USB0 Functional Clock Source Select, offset: 0x220 */
       uint8_t RESERVED_10[28];
  __IO uint32_t EUSBFCLKSEL;                       /**< USB1 (eUSB) Functional Clock Source Select, offset: 0x240 */
       uint8_t RESERVED_11[28];
  __IO uint32_t SDIO0FCLKSEL;                      /**< SDIO0 Functional Clock Source Select, offset: 0x260 */
  __IO uint32_t SDIO0FCLKDIV;                      /**< SDIO0 Functional Clock Divider, offset: 0x264 */
       uint8_t RESERVED_12[24];
  __IO uint32_t SDIO1FCLKSEL;                      /**< SDIO1 Functional Clock Source Select, offset: 0x280 */
  __IO uint32_t SDIO1FCLKDIV;                      /**< SDIO1 Functional Clock Divider, offset: 0x284 */
       uint8_t RESERVED_13[120];
  __IO uint32_t DPHYCLKSEL;                        /**< MIPI_DSI_Host PHY Clock Source Select, offset: 0x300 */
  __IO uint32_t DPHYCLKDIV;                        /**< MIPI_DSI_Host PHY Clock Divider, offset: 0x304 */
  __IO uint32_t DPHYESCCLKSEL;                     /**< MIPI_DSI_Host DPHY Escape Mode Clock Source Select, offset: 0x308 */
  __IO uint32_t DPHYESCRXCLKDIV;                   /**< MIPI_DSI_Host DPHY Escape Mode Receive Clock Divider, offset: 0x30C */
  __IO uint32_t DPHYESCTXCLKDIV;                   /**< MIPI_DSI_Host DPHY Escape Mode Transmit Clock Divider, offset: 0x310 */
       uint8_t RESERVED_14[12];
  __IO uint32_t VGPUCLKSEL;                        /**< VGPU Clock Source Select, offset: 0x320 */
  __IO uint32_t VGPUCLKDIV;                        /**< VGPU Clock Divider, offset: 0x324 */
  __IO uint32_t LPSPI14CLKSEL;                     /**< LPSPI14 Clock Source Select, offset: 0x328 */
  __IO uint32_t LPSPI14CLKDIV;                     /**< LPSPI14 Clock Divider, offset: 0x32C */
  __IO uint32_t LPSPI16CLKSEL;                     /**< LPSPI16 Clock Source Select, offset: 0x330 */
  __IO uint32_t LPSPI16CLKDIV;                     /**< LPSPI16 Clock Divider, offset: 0x334 */
  __IO uint32_t FLEXIOCLKSEL;                      /**< FLEXIO Clock Source Select, offset: 0x338 */
  __IO uint32_t FLEXIOCLKDIV;                      /**< FLEXIO Clock Divider, offset: 0x33C */
  __IO uint32_t LCDIFPIXELCLKSEL;                  /**< LCDIF Pixel Clock Source Select, offset: 0x340 */
  __IO uint32_t LCDIFPIXELCLKDIV;                  /**< LCDIF Pixel Clock Divider, offset: 0x344 */
       uint8_t RESERVED_15[952];
  __IO uint32_t LOWFREQCLKDIV;                     /**< Low frequency Clock Divider, offset: 0x700 */
       uint8_t RESERVED_16[268];
  __IO uint32_t PSCCTL0_SENS;                      /**< VDD1_SENSE Media Peripheral Clock Control 0, offset: 0x810 */
  __IO uint32_t PSCCTL1_SENS;                      /**< VDD1_SENSE Media Peripheral Clock Control 1, offset: 0x814 */
       uint8_t RESERVED_17[40];
  __IO uint32_t PSCCTL0_SENS_SET;                  /**< VDD1_SENSE Media Peripheral Clock Control 0 Set, offset: 0x840 */
  __IO uint32_t PSCCTL1_SENS_SET;                  /**< VDD1_SENSE Media Peripheral Clock Control 1 Set, offset: 0x844 */
       uint8_t RESERVED_18[40];
  __IO uint32_t PSCCTL0_SENS_CLR;                  /**< VDD1_SENSE Media Peripheral Clock Control 0 Clear, offset: 0x870 */
  __IO uint32_t PSCCTL1_SENS_CLR;                  /**< VDD1_SENSE Media Peripheral Clock Control 1 Clear, offset: 0x874 */
       uint8_t RESERVED_19[24];
  __IO uint32_t ONE_SRC_CLKSLICE_ENABLE_SENSE;     /**< One Source Clock Slice Enable for VDD1_SENSE Core, offset: 0x890 */
} CLKCTL4_Type;

/* ----------------------------------------------------------------------------
   -- CLKCTL4 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL4_Register_Masks CLKCTL4 Register Masks
 * @{
 */

