nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define CLKCTL4_DPHYCLKDIV_RESET_MASK            (0x20000000U)
#define CLKCTL4_DPHYCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_DPHYCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKDIV_RESET_SHIFT)) & CLKCTL4_DPHYCLKDIV_RESET_MASK)

#define CLKCTL4_DPHYCLKDIV_HALT_MASK             (0x40000000U)
#define CLKCTL4_DPHYCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_DPHYCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKDIV_HALT_SHIFT)) & CLKCTL4_DPHYCLKDIV_HALT_MASK)

#define CLKCTL4_DPHYCLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL4_DPHYCLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_DPHYCLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_DPHYCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name DPHYESCCLKSEL - MIPI_DSI_Host DPHY Escape Mode Clock Source Select */
/*! @{ */

#define CLKCTL4_DPHYESCCLKSEL_SEL_MASK           (0x3U)
#define CLKCTL4_DPHYESCCLKSEL_SEL_SHIFT          (0U)
/*! SEL - Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..main_pll_pfd1
 *  0b10..fro0_max
 *  0b11..audio_pll_pfd2
 */
#define CLKCTL4_DPHYESCCLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCCLKSEL_SEL_SHIFT)) & CLKCTL4_DPHYESCCLKSEL_SEL_MASK)

#define CLKCTL4_DPHYESCCLKSEL_SEL_EN_MASK        (0x4U)
#define CLKCTL4_DPHYESCCLKSEL_SEL_EN_SHIFT       (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for MIPI_DSI_Host DPHY clock.
 *  0b1..Enables mux output for MIPI_DSI_Host DPHY clock.
 */
#define CLKCTL4_DPHYESCCLKSEL_SEL_EN(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_DPHYESCCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name DPHYESCRXCLKDIV - MIPI_DSI_Host DPHY Escape Mode Receive Clock Divider */
/*! @{ */

#define CLKCTL4_DPHYESCRXCLKDIV_DIV_MASK         (0xFFU)
#define CLKCTL4_DPHYESCRXCLKDIV_DIV_SHIFT        (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_DPHYESCRXCLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCRXCLKDIV_DIV_SHIFT)) & CLKCTL4_DPHYESCRXCLKDIV_DIV_MASK)

#define CLKCTL4_DPHYESCRXCLKDIV_BUSY_MASK        (0x10000000U)
#define CLKCTL4_DPHYESCRXCLKDIV_BUSY_SHIFT       (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_DPHYESCRXCLKDIV_BUSY(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCRXCLKDIV_BUSY_SHIFT)) & CLKCTL4_DPHYESCRXCLKDIV_BUSY_MASK)

#define CLKCTL4_DPHYESCRXCLKDIV_RESET_MASK       (0x20000000U)
#define CLKCTL4_DPHYESCRXCLKDIV_RESET_SHIFT      (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_DPHYESCRXCLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCRXCLKDIV_RESET_SHIFT)) & CLKCTL4_DPHYESCRXCLKDIV_RESET_MASK)

#define CLKCTL4_DPHYESCRXCLKDIV_HALT_MASK        (0x40000000U)
#define CLKCTL4_DPHYESCRXCLKDIV_HALT_SHIFT       (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_DPHYESCRXCLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCRXCLKDIV_HALT_SHIFT)) & CLKCTL4_DPHYESCRXCLKDIV_HALT_MASK)

#define CLKCTL4_DPHYESCRXCLKDIV_REQFLAG_MASK     (0x80000000U)
#define CLKCTL4_DPHYESCRXCLKDIV_REQFLAG_SHIFT    (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_DPHYESCRXCLKDIV_REQFLAG(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCRXCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_DPHYESCRXCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name DPHYESCTXCLKDIV - MIPI_DSI_Host DPHY Escape Mode Transmit Clock Divider */
/*! @{ */

#define CLKCTL4_DPHYESCTXCLKDIV_DIV_MASK         (0xFFU)
#define CLKCTL4_DPHYESCTXCLKDIV_DIV_SHIFT        (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_DPHYESCTXCLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCTXCLKDIV_DIV_SHIFT)) & CLKCTL4_DPHYESCTXCLKDIV_DIV_MASK)

#define CLKCTL4_DPHYESCTXCLKDIV_BUSY_MASK        (0x10000000U)
#define CLKCTL4_DPHYESCTXCLKDIV_BUSY_SHIFT       (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_DPHYESCTXCLKDIV_BUSY(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCTXCLKDIV_BUSY_SHIFT)) & CLKCTL4_DPHYESCTXCLKDIV_BUSY_MASK)

#define CLKCTL4_DPHYESCTXCLKDIV_RESET_MASK       (0x20000000U)
#define CLKCTL4_DPHYESCTXCLKDIV_RESET_SHIFT      (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_DPHYESCTXCLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCTXCLKDIV_RESET_SHIFT)) & CLKCTL4_DPHYESCTXCLKDIV_RESET_MASK)

#define CLKCTL4_DPHYESCTXCLKDIV_HALT_MASK        (0x40000000U)
#define CLKCTL4_DPHYESCTXCLKDIV_HALT_SHIFT       (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_DPHYESCTXCLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCTXCLKDIV_HALT_SHIFT)) & CLKCTL4_DPHYESCTXCLKDIV_HALT_MASK)

#define CLKCTL4_DPHYESCTXCLKDIV_REQFLAG_MASK     (0x80000000U)
#define CLKCTL4_DPHYESCTXCLKDIV_REQFLAG_SHIFT    (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_DPHYESCTXCLKDIV_REQFLAG(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYESCTXCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_DPHYESCTXCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name VGPUCLKSEL - VGPU Clock Source Select */
/*! @{ */

#define CLKCTL4_VGPUCLKSEL_SEL_MASK              (0x3U)
#define CLKCTL4_VGPUCLKSEL_SEL_SHIFT             (0U)
/*! SEL - VGPU Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..main_pll_pfd2
 */
#define CLKCTL4_VGPUCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL4_VGPUCLKSEL_SEL_SHIFT)) & CLKCTL4_VGPUCLKSEL_SEL_MASK)

