nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define CLKCTL4_PSCCTL1_SENS_SET_USDHC0_MASK     (0x10U)
#define CLKCTL4_PSCCTL1_SENS_SET_USDHC0_SHIFT    (4U)
/*! uSDHC0 - uSDHC0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL4_PSCCTL1_SENS_SET_USDHC0(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_SENS_SET_USDHC0_SHIFT)) & CLKCTL4_PSCCTL1_SENS_SET_USDHC0_MASK)

#define CLKCTL4_PSCCTL1_SENS_SET_USDHC1_MASK     (0x20U)
#define CLKCTL4_PSCCTL1_SENS_SET_USDHC1_SHIFT    (5U)
/*! uSDHC1 - uSDHC1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL4_PSCCTL1_SENS_SET_USDHC1(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_SENS_SET_USDHC1_SHIFT)) & CLKCTL4_PSCCTL1_SENS_SET_USDHC1_MASK)
/*! @} */

/*! @name PSCCTL0_SENS_CLR - VDD1_SENSE Media Peripheral Clock Control 0 Clear */
/*! @{ */

#define CLKCTL4_PSCCTL0_SENS_CLR_VGPU_MASK       (0x4U)
#define CLKCTL4_PSCCTL0_SENS_CLR_VGPU_SHIFT      (2U)
/*! VGPU - VGPU Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_VGPU(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_VGPU_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_VGPU_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_MIPI_DSI_HOST_MASK (0x10U)
#define CLKCTL4_PSCCTL0_SENS_CLR_MIPI_DSI_HOST_SHIFT (4U)
/*! MIPI_DSI_HOST - MIPI_DSI_HOST Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_MIPI_DSI_HOST(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_MIPI_DSI_HOST_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_MIPI_DSI_HOST_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_LPSPI16_MASK    (0x20U)
#define CLKCTL4_PSCCTL0_SENS_CLR_LPSPI16_SHIFT   (5U)
/*! LPSPI16 - LPSPI16 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_LPSPI16(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_LPSPI16_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_LPSPI16_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_LPSPI14_MASK    (0x40U)
#define CLKCTL4_PSCCTL0_SENS_CLR_LPSPI14_SHIFT   (6U)
/*! LPSPI14 - LPSPI14 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_LPSPI14(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_LPSPI14_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_LPSPI14_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_XSPI2_MASK      (0x100U)
#define CLKCTL4_PSCCTL0_SENS_CLR_XSPI2_SHIFT     (8U)
/*! XSPI2 - XSPI2 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_XSPI2(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_XSPI2_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_XSPI2_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_MMU2_MASK       (0x800U)
#define CLKCTL4_PSCCTL0_SENS_CLR_MMU2_SHIFT      (11U)
/*! MMU2 - MMU2 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_MMU2(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_MMU2_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_MMU2_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY5_MASK    (0x2000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY5_SHIFT   (13U)
/*! GLIKEY5 - GLIKEY5 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY5(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY5_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY5_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_FLEXIO0_MASK    (0x8000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_FLEXIO0_SHIFT   (15U)
/*! FLEXIO0 - FLEXIO0 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_FLEXIO0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_FLEXIO0_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_FLEXIO0_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_LCDIF_MASK      (0x400000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_LCDIF_SHIFT     (22U)
/*! LCDIF - LCDIF Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_LCDIF(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_LCDIF_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_LCDIF_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_SYSCON4_MASK    (0x800000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_SYSCON4_SHIFT   (23U)
/*! SYSCON4 - SYSCON4 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_SYSCON4(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_SYSCON4_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_SYSCON4_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_JPEGDEC_MASK    (0x1000000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_JPEGDEC_SHIFT   (24U)
/*! JPEGDEC - JPEGDEC Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_JPEGDEC(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_JPEGDEC_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_JPEGDEC_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_PNGDEC_MASK     (0x2000000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_PNGDEC_SHIFT    (25U)
/*! PNGDEC - PNG Decoder Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_PNGDEC(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_PNGDEC_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_PNGDEC_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_EZHV_MASK       (0x4000000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_EZHV_SHIFT      (26U)
/*! EZHV - EZHV Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_EZHV(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_EZHV_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_EZHV_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_AXBS_EZH_MASK   (0x10000000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_AXBS_EZH_SHIFT  (28U)
/*! AXBS_EZH - AXBS_EZHV Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_AXBS_EZH(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_AXBS_EZH_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_AXBS_EZH_MASK)

#define CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY2_MASK    (0x20000000U)
#define CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY2_SHIFT   (29U)
/*! GLIKEY2 - GLIKEY2 Clock
 *  0b1..Disable
 *  0b0..No effect
 */
#define CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY2(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY2_SHIFT)) & CLKCTL4_PSCCTL0_SENS_CLR_GLIKEY2_MASK)
/*! @} */

/*! @name PSCCTL1_SENS_CLR - VDD1_SENSE Media Peripheral Clock Control 1 Clear */
/*! @{ */

#define CLKCTL4_PSCCTL1_SENS_CLR_USB0_MASK       (0x1U)
#define CLKCTL4_PSCCTL1_SENS_CLR_USB0_SHIFT      (0U)
/*! USB0 - USB0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL4_PSCCTL1_SENS_CLR_USB0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL1_SENS_CLR_USB0_SHIFT)) & CLKCTL4_PSCCTL1_SENS_CLR_USB0_MASK)

