nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define PMC_PDSLEEPCFG3_SRAM25_MASK              (0x2000000U)
#define PMC_PDSLEEPCFG3_SRAM25_SHIFT             (25U)
/*! SRAM25 - RAM Partition 25 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM25(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM25_SHIFT)) & PMC_PDSLEEPCFG3_SRAM25_MASK)

#define PMC_PDSLEEPCFG3_SRAM26_MASK              (0x4000000U)
#define PMC_PDSLEEPCFG3_SRAM26_SHIFT             (26U)
/*! SRAM26 - RAM Partition 26 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM26(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM26_SHIFT)) & PMC_PDSLEEPCFG3_SRAM26_MASK)

#define PMC_PDSLEEPCFG3_SRAM27_MASK              (0x8000000U)
#define PMC_PDSLEEPCFG3_SRAM27_SHIFT             (27U)
/*! SRAM27 - RAM Partition 27 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM27(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM27_SHIFT)) & PMC_PDSLEEPCFG3_SRAM27_MASK)

#define PMC_PDSLEEPCFG3_SRAM28_MASK              (0x10000000U)
#define PMC_PDSLEEPCFG3_SRAM28_SHIFT             (28U)
/*! SRAM28 - RAM Partition 28 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM28(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM28_SHIFT)) & PMC_PDSLEEPCFG3_SRAM28_MASK)

#define PMC_PDSLEEPCFG3_SRAM29_MASK              (0x20000000U)
#define PMC_PDSLEEPCFG3_SRAM29_SHIFT             (29U)
/*! SRAM29 - RAM Partition 29 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG3_SRAM29(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM29_SHIFT)) & PMC_PDSLEEPCFG3_SRAM29_MASK)
/*! @} */

/*! @name PDSLEEPCFG4 - PD Sleep Configuration 4 in Sense Domain */
/*! @{ */

#define PMC_PDSLEEPCFG4_SDHC0_SRAM_MASK          (0x1U)
#define PMC_PDSLEEPCFG4_SDHC0_SRAM_SHIFT         (0U)
/*! SDHC0_SRAM - uSDHC0 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_SDHC0_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_SDHC0_SRAM_SHIFT)) & PMC_PDSLEEPCFG4_SDHC0_SRAM_MASK)

#define PMC_PDSLEEPCFG4_SDHC1_SRAM_MASK          (0x2U)
#define PMC_PDSLEEPCFG4_SDHC1_SRAM_SHIFT         (1U)
/*! SDHC1_SRAM - uSDHC1 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_SDHC1_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_SDHC1_SRAM_SHIFT)) & PMC_PDSLEEPCFG4_SDHC1_SRAM_MASK)

#define PMC_PDSLEEPCFG4_USB0_SRAM_MASK           (0x4U)
#define PMC_PDSLEEPCFG4_USB0_SRAM_SHIFT          (2U)
/*! USB0_SRAM - USB0 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_USB0_SRAM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_USB0_SRAM_SHIFT)) & PMC_PDSLEEPCFG4_USB0_SRAM_MASK)

#define PMC_PDSLEEPCFG4_USB1_SRAM_MASK           (0x8U)
#define PMC_PDSLEEPCFG4_USB1_SRAM_SHIFT          (3U)
/*! USB1_SRAM - USB1 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_USB1_SRAM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_USB1_SRAM_SHIFT)) & PMC_PDSLEEPCFG4_USB1_SRAM_MASK)

#define PMC_PDSLEEPCFG4_JPEG_MASK                (0x10U)
#define PMC_PDSLEEPCFG4_JPEG_SHIFT               (4U)
/*! JPEG - JPEGDEC
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_JPEG(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_JPEG_SHIFT)) & PMC_PDSLEEPCFG4_JPEG_MASK)

#define PMC_PDSLEEPCFG4_PNG_MASK                 (0x20U)
#define PMC_PDSLEEPCFG4_PNG_SHIFT                (5U)
/*! PNG - PNGDEC
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_PNG(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_PNG_SHIFT)) & PMC_PDSLEEPCFG4_PNG_MASK)

#define PMC_PDSLEEPCFG4_MIPI_MASK                (0x40U)
#define PMC_PDSLEEPCFG4_MIPI_SHIFT               (6U)
/*! MIPI - MIPI PHY
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_MIPI(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_MIPI_SHIFT)) & PMC_PDSLEEPCFG4_MIPI_MASK)

#define PMC_PDSLEEPCFG4_GPU_MASK                 (0x80U)
#define PMC_PDSLEEPCFG4_GPU_SHIFT                (7U)
/*! GPU - VGPU
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_GPU(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_GPU_SHIFT)) & PMC_PDSLEEPCFG4_GPU_MASK)

#define PMC_PDSLEEPCFG4_DMA2_3_MASK              (0x100U)
#define PMC_PDSLEEPCFG4_DMA2_3_SHIFT             (8U)
/*! DMA2_3 - DMA2 and DMA3
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_DMA2_3(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_DMA2_3_SHIFT)) & PMC_PDSLEEPCFG4_DMA2_3_MASK)

#define PMC_PDSLEEPCFG4_DMA0_1_P_E_MASK          (0x200U)
#define PMC_PDSLEEPCFG4_DMA0_1_P_E_SHIFT         (9U)
/*! DMA0_1_P_E - DMA0-1, PKC, and ETF
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_DMA0_1_P_E(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_DMA0_1_P_E_SHIFT)) & PMC_PDSLEEPCFG4_DMA0_1_P_E_MASK)

#define PMC_PDSLEEPCFG4_CPU0_CCACHE_MASK         (0x400U)
#define PMC_PDSLEEPCFG4_CPU0_CCACHE_SHIFT        (10U)
/*! CPU0_CCACHE - CPU0 Code Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_CPU0_CCACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_CPU0_CCACHE_SHIFT)) & PMC_PDSLEEPCFG4_CPU0_CCACHE_MASK)

#define PMC_PDSLEEPCFG4_CPU0_SCACHE_MASK         (0x800U)
#define PMC_PDSLEEPCFG4_CPU0_SCACHE_SHIFT        (11U)
/*! CPU0_SCACHE - CPU0 System Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_CPU0_SCACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_CPU0_SCACHE_SHIFT)) & PMC_PDSLEEPCFG4_CPU0_SCACHE_MASK)

#define PMC_PDSLEEPCFG4_DSP_ICACHE_MASK          (0x1000U)
#define PMC_PDSLEEPCFG4_DSP_ICACHE_SHIFT         (12U)
/*! DSP_ICACHE - HiFi4 Instruction Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_DSP_ICACHE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_DSP_ICACHE_SHIFT)) & PMC_PDSLEEPCFG4_DSP_ICACHE_MASK)

#define PMC_PDSLEEPCFG4_DSP_DCACHE_MASK          (0x2000U)
#define PMC_PDSLEEPCFG4_DSP_DCACHE_SHIFT         (13U)
/*! DSP_DCACHE - HiFi4 Data Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_DSP_DCACHE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_DSP_DCACHE_SHIFT)) & PMC_PDSLEEPCFG4_DSP_DCACHE_MASK)

#define PMC_PDSLEEPCFG4_DSP_ITCM_MASK            (0x4000U)
#define PMC_PDSLEEPCFG4_DSP_ITCM_SHIFT           (14U)
/*! DSP_ITCM - HiFi4 Instruction TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_DSP_ITCM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_DSP_ITCM_SHIFT)) & PMC_PDSLEEPCFG4_DSP_ITCM_MASK)

#define PMC_PDSLEEPCFG4_DSP_DTCM_MASK            (0x8000U)
#define PMC_PDSLEEPCFG4_DSP_DTCM_SHIFT           (15U)
/*! DSP_DTCM - HiFi4 Data TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_DSP_DTCM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_DSP_DTCM_SHIFT)) & PMC_PDSLEEPCFG4_DSP_DTCM_MASK)

