nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define PMC_PDCFGSTATUS3_SRAM16_MASK             (0x10000U)
#define PMC_PDCFGSTATUS3_SRAM16_SHIFT            (16U)
/*! SRAM16 - RAM Partition 16 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM16(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM16_SHIFT)) & PMC_PDCFGSTATUS3_SRAM16_MASK)

#define PMC_PDCFGSTATUS3_SRAM17_MASK             (0x20000U)
#define PMC_PDCFGSTATUS3_SRAM17_SHIFT            (17U)
/*! SRAM17 - RAM Partition 17 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM17(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM17_SHIFT)) & PMC_PDCFGSTATUS3_SRAM17_MASK)

#define PMC_PDCFGSTATUS3_SRAM18_MASK             (0x40000U)
#define PMC_PDCFGSTATUS3_SRAM18_SHIFT            (18U)
/*! SRAM18 - RAM Partition 18 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM18(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM18_SHIFT)) & PMC_PDCFGSTATUS3_SRAM18_MASK)

#define PMC_PDCFGSTATUS3_SRAM19_MASK             (0x80000U)
#define PMC_PDCFGSTATUS3_SRAM19_SHIFT            (19U)
/*! SRAM19 - RAM Partition 19 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM19(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM19_SHIFT)) & PMC_PDCFGSTATUS3_SRAM19_MASK)

#define PMC_PDCFGSTATUS3_SRAM20_MASK             (0x100000U)
#define PMC_PDCFGSTATUS3_SRAM20_SHIFT            (20U)
/*! SRAM20 - RAM Partition 20 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM20(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM20_SHIFT)) & PMC_PDCFGSTATUS3_SRAM20_MASK)

#define PMC_PDCFGSTATUS3_SRAM21_MASK             (0x200000U)
#define PMC_PDCFGSTATUS3_SRAM21_SHIFT            (21U)
/*! SRAM21 - RAM Partition 21 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM21(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM21_SHIFT)) & PMC_PDCFGSTATUS3_SRAM21_MASK)

#define PMC_PDCFGSTATUS3_SRAM22_MASK             (0x400000U)
#define PMC_PDCFGSTATUS3_SRAM22_SHIFT            (22U)
/*! SRAM22 - RAM Partition 22 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM22(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM22_SHIFT)) & PMC_PDCFGSTATUS3_SRAM22_MASK)

#define PMC_PDCFGSTATUS3_SRAM23_MASK             (0x800000U)
#define PMC_PDCFGSTATUS3_SRAM23_SHIFT            (23U)
/*! SRAM23 - RAM Partition 23 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM23(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM23_SHIFT)) & PMC_PDCFGSTATUS3_SRAM23_MASK)

#define PMC_PDCFGSTATUS3_SRAM24_MASK             (0x1000000U)
#define PMC_PDCFGSTATUS3_SRAM24_SHIFT            (24U)
/*! SRAM24 - RAM Partition 24 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM24(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM24_SHIFT)) & PMC_PDCFGSTATUS3_SRAM24_MASK)

#define PMC_PDCFGSTATUS3_SRAM25_MASK             (0x2000000U)
#define PMC_PDCFGSTATUS3_SRAM25_SHIFT            (25U)
/*! SRAM25 - RAM Partition 25 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM25(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM25_SHIFT)) & PMC_PDCFGSTATUS3_SRAM25_MASK)

#define PMC_PDCFGSTATUS3_SRAM26_MASK             (0x4000000U)
#define PMC_PDCFGSTATUS3_SRAM26_SHIFT            (26U)
/*! SRAM26 - RAM Partition 26 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM26(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM26_SHIFT)) & PMC_PDCFGSTATUS3_SRAM26_MASK)

#define PMC_PDCFGSTATUS3_SRAM27_MASK             (0x8000000U)
#define PMC_PDCFGSTATUS3_SRAM27_SHIFT            (27U)
/*! SRAM27 - RAM Partition 27 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM27(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM27_SHIFT)) & PMC_PDCFGSTATUS3_SRAM27_MASK)

#define PMC_PDCFGSTATUS3_SRAM28_MASK             (0x10000000U)
#define PMC_PDCFGSTATUS3_SRAM28_SHIFT            (28U)
/*! SRAM28 - RAM Partition 28 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM28(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM28_SHIFT)) & PMC_PDCFGSTATUS3_SRAM28_MASK)

#define PMC_PDCFGSTATUS3_SRAM29_MASK             (0x20000000U)
#define PMC_PDCFGSTATUS3_SRAM29_SHIFT            (29U)
/*! SRAM29 - RAM Partition 29 Periphery Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS3_SRAM29(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS3_SRAM29_SHIFT)) & PMC_PDCFGSTATUS3_SRAM29_MASK)
/*! @} */

/*! @name PDCFGSTATUS4 - PD Configuration Status 4 */
/*! @{ */

#define PMC_PDCFGSTATUS4_SDHC0_SRAM_MASK         (0x1U)
#define PMC_PDCFGSTATUS4_SDHC0_SRAM_SHIFT        (0U)
/*! SDHC0_SRAM - uSDHC0 RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_SDHC0_SRAM(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_SDHC0_SRAM_SHIFT)) & PMC_PDCFGSTATUS4_SDHC0_SRAM_MASK)

#define PMC_PDCFGSTATUS4_SDHC1_SRAM_MASK         (0x2U)
#define PMC_PDCFGSTATUS4_SDHC1_SRAM_SHIFT        (1U)
/*! SDHC1_SRAM - uSDHC1 RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_SDHC1_SRAM(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_SDHC1_SRAM_SHIFT)) & PMC_PDCFGSTATUS4_SDHC1_SRAM_MASK)

#define PMC_PDCFGSTATUS4_USB0_SRAM_MASK          (0x4U)
#define PMC_PDCFGSTATUS4_USB0_SRAM_SHIFT         (2U)
/*! USB0_SRAM - USB0 RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_USB0_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_USB0_SRAM_SHIFT)) & PMC_PDCFGSTATUS4_USB0_SRAM_MASK)

#define PMC_PDCFGSTATUS4_USB1_SRAM_MASK          (0x8U)
#define PMC_PDCFGSTATUS4_USB1_SRAM_SHIFT         (3U)
/*! USB1_SRAM - USB1 RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_USB1_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_USB1_SRAM_SHIFT)) & PMC_PDCFGSTATUS4_USB1_SRAM_MASK)

#define PMC_PDCFGSTATUS4_JPEG_MASK               (0x10U)
#define PMC_PDCFGSTATUS4_JPEG_SHIFT              (4U)
/*! JPEG - JPEGDEC RAMs Array
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS4_JPEG(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS4_JPEG_SHIFT)) & PMC_PDCFGSTATUS4_JPEG_MASK)

