nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define RSTCTL3_PRSTCTL1_SET_INPUTMUX1_MASK      (0x4000U)
#define RSTCTL3_PRSTCTL1_SET_INPUTMUX1_SHIFT     (14U)
/*! INPUTMUX1 - INPUTMUX1 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_INPUTMUX1(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_INPUTMUX1_SHIFT)) & RSTCTL3_PRSTCTL1_SET_INPUTMUX1_MASK)

#define RSTCTL3_PRSTCTL1_SET_LPI2C15_MASK        (0x40000U)
#define RSTCTL3_PRSTCTL1_SET_LPI2C15_SHIFT       (18U)
/*! LPI2C15 - LPI2C15 Reset
 *  0b0..No effect
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL1_SET_LPI2C15(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_SET_LPI2C15_SHIFT)) & RSTCTL3_PRSTCTL1_SET_LPI2C15_MASK)
/*! @} */

/*! @name PRSTCTL0_CLR - Sense Domain Peripheral Reset Control 0 CLR */
/*! @{ */

#define RSTCTL3_PRSTCTL0_CLR_IOPCTL1_MASK        (0x1U)
#define RSTCTL3_PRSTCTL0_CLR_IOPCTL1_SHIFT       (0U)
/*! IOPCTL1 - IOPCTL1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL0_CLR_IOPCTL1(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL0_CLR_IOPCTL1_SHIFT)) & RSTCTL3_PRSTCTL0_CLR_IOPCTL1_MASK)

#define RSTCTL3_PRSTCTL0_CLR_CPU1_MASK           (0x80000000U)
#define RSTCTL3_PRSTCTL0_CLR_CPU1_SHIFT          (31U)
/*! CPU1 - CPU1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL0_CLR_CPU1(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL0_CLR_CPU1_SHIFT)) & RSTCTL3_PRSTCTL0_CLR_CPU1_MASK)
/*! @} */

/*! @name PRSTCTL1_CLR - Sense Peripheral Reset Control 1 CLR */
/*! @{ */

#define RSTCTL3_PRSTCTL1_CLR_MU0_MASK            (0x2U)
#define RSTCTL3_PRSTCTL1_CLR_MU0_SHIFT           (1U)
/*! MU0 - MU0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_MU0(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_MU0_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_MU0_MASK)

#define RSTCTL3_PRSTCTL1_CLR_MU1_MASK            (0x4U)
#define RSTCTL3_PRSTCTL1_CLR_MU1_SHIFT           (2U)
/*! MU1 - MU1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_MU1(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_MU1_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_MU1_MASK)

#define RSTCTL3_PRSTCTL1_CLR_MU2_MASK            (0x8U)
#define RSTCTL3_PRSTCTL1_CLR_MU2_SHIFT           (3U)
/*! MU2 - MU2 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_MU2(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_MU2_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_MU2_MASK)

#define RSTCTL3_PRSTCTL1_CLR_SEMA42_0_MASK       (0x20U)
#define RSTCTL3_PRSTCTL1_CLR_SEMA42_0_SHIFT      (5U)
/*! SEMA42_0 - SEMA42_0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_SEMA42_0(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_SEMA42_0_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_SEMA42_0_MASK)

#define RSTCTL3_PRSTCTL1_CLR_ADC0_MASK           (0x40U)
#define RSTCTL3_PRSTCTL1_CLR_ADC0_SHIFT          (6U)
/*! ADC0 - ADC0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_ADC0(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_ADC0_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_ADC0_MASK)

#define RSTCTL3_PRSTCTL1_CLR_SDADC_MASK          (0x80U)
#define RSTCTL3_PRSTCTL1_CLR_SDADC_SHIFT         (7U)
/*! SDADC - SDADC Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_SDADC(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_SDADC_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_SDADC_MASK)

#define RSTCTL3_PRSTCTL1_CLR_ACMP0_MASK          (0x100U)
#define RSTCTL3_PRSTCTL1_CLR_ACMP0_SHIFT         (8U)
/*! ACMP0 - ACMP0 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_ACMP0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_ACMP0_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_ACMP0_MASK)

#define RSTCTL3_PRSTCTL1_CLR_MICFIL_MASK         (0x200U)
#define RSTCTL3_PRSTCTL1_CLR_MICFIL_SHIFT        (9U)
/*! MICFIL - MICFIL Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_MICFIL(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_MICFIL_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_MICFIL_MASK)

#define RSTCTL3_PRSTCTL1_CLR_INPUTMUX1_MASK      (0x4000U)
#define RSTCTL3_PRSTCTL1_CLR_INPUTMUX1_SHIFT     (14U)
/*! INPUTMUX1 - INPUTMUX1 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_INPUTMUX1(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_INPUTMUX1_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_INPUTMUX1_MASK)

#define RSTCTL3_PRSTCTL1_CLR_LPI2C15_MASK        (0x40000U)
#define RSTCTL3_PRSTCTL1_CLR_LPI2C15_SHIFT       (18U)
/*! LPI2C15 - LPI2C15 Reset
 *  0b0..No effect
 *  0b1..Clears reset.
 */
#define RSTCTL3_PRSTCTL1_CLR_LPI2C15(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL1_CLR_LPI2C15_SHIFT)) & RSTCTL3_PRSTCTL1_CLR_LPI2C15_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RSTCTL3_Register_Masks */


/* RSTCTL3 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral RSTCTL3 base address */
  #define RSTCTL3_BASE                             (0x50060000u)
  /** Peripheral RSTCTL3 base address */
  #define RSTCTL3_BASE_NS                          (0x40060000u)
  /** Peripheral RSTCTL3 base pointer */
  #define RSTCTL3                                  ((RSTCTL3_Type *)RSTCTL3_BASE)
  /** Peripheral RSTCTL3 base pointer */
  #define RSTCTL3_NS                               ((RSTCTL3_Type *)RSTCTL3_BASE_NS)
  /** Array initializer of RSTCTL3 peripheral base addresses */
  #define RSTCTL3_BASE_ADDRS                       { RSTCTL3_BASE }
  /** Array initializer of RSTCTL3 peripheral base pointers */
  #define RSTCTL3_BASE_PTRS                        { RSTCTL3 }
  /** Array initializer of RSTCTL3 peripheral base addresses */
  #define RSTCTL3_BASE_ADDRS_NS                    { RSTCTL3_BASE_NS }
  /** Array initializer of RSTCTL3 peripheral base pointers */
  #define RSTCTL3_BASE_PTRS_NS                     { RSTCTL3_NS }
#else
  /** Peripheral RSTCTL3 base address */
  #define RSTCTL3_BASE                             (0x40060000u)
  /** Peripheral RSTCTL3 base pointer */
  #define RSTCTL3                                  ((RSTCTL3_Type *)RSTCTL3_BASE)
  /** Array initializer of RSTCTL3 peripheral base addresses */
  #define RSTCTL3_BASE_ADDRS                       { RSTCTL3_BASE }
  /** Array initializer of RSTCTL3 peripheral base pointers */
  #define RSTCTL3_BASE_PTRS                        { RSTCTL3 }
#endif

/*!
 * @}
 */ /* end of group RSTCTL3_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RSTCTL4 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTL4_Peripheral_Access_Layer RSTCTL4 Peripheral Access Layer
 * @{
 */

/** RSTCTL4 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PRSTCTL0;                          /**< Media Domain Peripheral Reset Control 0, offset: 0x10 */
  __IO uint32_t PRSTCTL1;                          /**< Media Domain (Interface) Peripheral Reset Control 1, offset: 0x14 */
       uint8_t RESERVED_1[40];
  __O  uint32_t PRSTCTL0_SET;                      /**< Media Domain Peripheral Reset Control 0 SET, offset: 0x40 */
  __O  uint32_t PRSTCTL1_SET;                      /**< Media Domain (Interface) Peripheral Reset Control 1 SET, offset: 0x44 */
       uint8_t RESERVED_2[40];
  __O  uint32_t PRSTCTL0_CLR;                      /**< Media Domain Peripheral Reset Control 0 CLR, offset: 0x70 */
  __O  uint32_t PRSTCTL1_CLR;                      /**< Media Domain (Interface) Peripheral Reset Control 1 CLR, offset: 0x74 */
} RSTCTL4_Type;

/* ----------------------------------------------------------------------------
   -- RSTCTL4 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTL4_Register_Masks RSTCTL4 Register Masks
 * @{
 */

/*! @name PRSTCTL0 - Media Domain Peripheral Reset Control 0 */
/*! @{ */

#define RSTCTL4_PRSTCTL0_VGPU_MASK               (0x4U)
#define RSTCTL4_PRSTCTL0_VGPU_SHIFT              (2U)
/*! VGPU - VGPU Reset
 *  0b1..Sets reset.
 *  0b0..Clears reset.
 */
#define RSTCTL4_PRSTCTL0_VGPU(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL4_PRSTCTL0_VGPU_SHIFT)) & RSTCTL4_PRSTCTL0_VGPU_MASK)

