nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define SLEEPCON1_SHARED_MASK0_RTC_MASK_MASK     (0x40U)
#define SLEEPCON1_SHARED_MASK0_RTC_MASK_SHIFT    (6U)
/*! RTC_MASK - Mask Bit of RTC0 and RTC1
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_RTC_MASK(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_RTC_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_RTC_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_VGPU_MASK_MASK    (0x10000U)
#define SLEEPCON1_SHARED_MASK0_VGPU_MASK_SHIFT   (16U)
/*! VGPU_MASK - Mask Bit of VGPU
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_VGPU_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_VGPU_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_VGPU_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_EZHV_MASK_MASK    (0x20000U)
#define SLEEPCON1_SHARED_MASK0_EZHV_MASK_SHIFT   (17U)
/*! EZHV_MASK - Mask Bit of EZH-V
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_EZHV_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_EZHV_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_EZHV_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_XSPI2_MASK_MASK   (0x40000U)
#define SLEEPCON1_SHARED_MASK0_XSPI2_MASK_SHIFT  (18U)
/*! XSPI2_MASK - Mask Bit of XSPI2
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_XSPI2_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_XSPI2_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_XSPI2_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_LPSPI14_MASK_MASK (0x80000U)
#define SLEEPCON1_SHARED_MASK0_LPSPI14_MASK_SHIFT (19U)
/*! LPSPI14_MASK - Mask Bit of LPSPI14
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_LPSPI14_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_LPSPI14_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_LPSPI14_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_LPSPI16_MASK_MASK (0x100000U)
#define SLEEPCON1_SHARED_MASK0_LPSPI16_MASK_SHIFT (20U)
/*! LPSPI16_MASK - Mask Bit of LPSPI16
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_LPSPI16_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_LPSPI16_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_LPSPI16_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_FLEXIO_MASK_MASK  (0x200000U)
#define SLEEPCON1_SHARED_MASK0_FLEXIO_MASK_SHIFT (21U)
/*! FLEXIO_MASK - Mask Bit of FLEXIO
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_FLEXIO_MASK(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_FLEXIO_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_FLEXIO_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_NIC0_MASK_MASK    (0x400000U)
#define SLEEPCON1_SHARED_MASK0_NIC0_MASK_SHIFT   (22U)
/*! NIC0_MASK - Mask Bit of NIC_MEDIA0
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_NIC0_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_NIC0_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_NIC0_MASK_MASK)

#define SLEEPCON1_SHARED_MASK0_NIC1_MASK_MASK    (0x800000U)
#define SLEEPCON1_SHARED_MASK0_NIC1_MASK_SHIFT   (23U)
/*! NIC1_MASK - Mask Bit of NIC_MEDIA1
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_SHARED_MASK0_NIC1_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_NIC1_MASK_SHIFT)) & SLEEPCON1_SHARED_MASK0_NIC1_MASK_MASK)
/*! @} */

/*! @name SHARED_MASK0_SET - Shared Resources Mask Set */
/*! @{ */

#define SLEEPCON1_SHARED_MASK0_SET_ADC0_MASK_SET_MASK (0x1U)
#define SLEEPCON1_SHARED_MASK0_SET_ADC0_MASK_SET_SHIFT (0U)
/*! ADC0_MASK_SET - ADC0 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_ADC0_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_ADC0_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_ADC0_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_ACMP0_MASK_SET_MASK (0x2U)
#define SLEEPCON1_SHARED_MASK0_SET_ACMP0_MASK_SET_SHIFT (1U)
/*! ACMP0_MASK_SET - ACMP0 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_ACMP0_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_ACMP0_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_ACMP0_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_MICFIL_MASK_SET_MASK (0x4U)
#define SLEEPCON1_SHARED_MASK0_SET_MICFIL_MASK_SET_SHIFT (2U)
/*! MICFIL_MASK_SET - MICFIL Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_MICFIL_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_MICFIL_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_MICFIL_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_LPI2C15_MASK_SET_MASK (0x8U)
#define SLEEPCON1_SHARED_MASK0_SET_LPI2C15_MASK_SET_SHIFT (3U)
/*! LPI2C15_MASK_SET - LPI2C15 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_LPI2C15_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_LPI2C15_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_LPI2C15_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_GDET2_MASK_SET_MASK (0x10U)
#define SLEEPCON1_SHARED_MASK0_SET_GDET2_MASK_SET_SHIFT (4U)
/*! GDET2_MASK_SET - GDET2 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_GDET2_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_GDET2_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_GDET2_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_GDET3_MASK_SET_MASK (0x20U)
#define SLEEPCON1_SHARED_MASK0_SET_GDET3_MASK_SET_SHIFT (5U)
/*! GDET3_MASK_SET - GDET3 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_GDET3_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_GDET3_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_GDET3_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_RTC_MASK_SET_MASK (0x40U)
#define SLEEPCON1_SHARED_MASK0_SET_RTC_MASK_SET_SHIFT (6U)
/*! RTC_MASK_SET - RTC0 and RTC1 Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_RTC_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_RTC_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_RTC_MASK_SET_MASK)

#define SLEEPCON1_SHARED_MASK0_SET_VGPU_MASK_SET_MASK (0x10000U)
#define SLEEPCON1_SHARED_MASK0_SET_VGPU_MASK_SET_SHIFT (16U)
/*! VGPU_MASK_SET - VGPU Mask Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_SHARED_MASK0_SET_VGPU_MASK_SET(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHARED_MASK0_SET_VGPU_MASK_SET_SHIFT)) & SLEEPCON1_SHARED_MASK0_SET_VGPU_MASK_SET_MASK)

