nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define SLEEPCON1_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_MASK (0x400000U)
#define SLEEPCON1_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_SHIFT (22U)
/*! GDET3_LPACCEPT - GDET3 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_SHIFT)) & SLEEPCON1_SHA_MEDSEN_TSTAT0_GDET3_LPACCEPT_MASK)

#define SLEEPCON1_SHA_MEDSEN_TSTAT0_RTC_STOP_MASK (0x80000000U)
#define SLEEPCON1_SHA_MEDSEN_TSTAT0_RTC_STOP_SHIFT (31U)
/*! RTC_STOP - RTC0 and RTC1 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON1_SHA_MEDSEN_TSTAT0_RTC_STOP(x)  (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_SHA_MEDSEN_TSTAT0_RTC_STOP_SHIFT)) & SLEEPCON1_SHA_MEDSEN_TSTAT0_RTC_STOP_MASK)
/*! @} */

/*! @name PRIVATE_CSTAT0 - Private Resources Controllers Low-power Status */
/*! @{ */

#define SLEEPCON1_PRIVATE_CSTAT0_EDMA2_STOP_MASK (0x1U)
#define SLEEPCON1_PRIVATE_CSTAT0_EDMA2_STOP_SHIFT (0U)
/*! EDMA2_STOP - eDMA2 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON1_PRIVATE_CSTAT0_EDMA2_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_CSTAT0_EDMA2_STOP_SHIFT)) & SLEEPCON1_PRIVATE_CSTAT0_EDMA2_STOP_MASK)

#define SLEEPCON1_PRIVATE_CSTAT0_EDMA3_STOP_MASK (0x2U)
#define SLEEPCON1_PRIVATE_CSTAT0_EDMA3_STOP_SHIFT (1U)
/*! EDMA3_STOP - eDMA3 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON1_PRIVATE_CSTAT0_EDMA3_STOP(x)   (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_CSTAT0_EDMA3_STOP_SHIFT)) & SLEEPCON1_PRIVATE_CSTAT0_EDMA3_STOP_MASK)
/*! @} */

/*! @name PRIVATE_TSTAT0 - Private Resources Targets Low-power Status 0 */
/*! @{ */

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_B_LPACCEPT_MASK (0x1U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_B_LPACCEPT_SHIFT (0U)
/*! LP_FLEXCOMM17_B_LPACCEPT - LP_FLEXCOMM17 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_B_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_B_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_B_LPACCEPT_MASK (0x2U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_B_LPACCEPT_SHIFT (1U)
/*! LP_FLEXCOMM18_B_LPACCEPT - LP_FLEXCOMM18 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_B_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_B_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_B_LPACCEPT_MASK (0x4U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_B_LPACCEPT_SHIFT (2U)
/*! LP_FLEXCOMM19_B_LPACCEPT - LP_FLEXCOMM19 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_B_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_B_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_B_LPACCEPT_MASK (0x8U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_B_LPACCEPT_SHIFT (3U)
/*! LP_FLEXCOMM20_B_LPACCEPT - LP_FLEXCOMM20 Bus Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_B_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_B_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM20_B_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_SAI3_LPACCEPT_MASK (0x10U)
#define SLEEPCON1_PRIVATE_TSTAT0_SAI3_LPACCEPT_SHIFT (4U)
/*! SAI3_LPACCEPT - SAI3 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_SAI3_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_SAI3_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_SAI3_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_GPIO8_LPACCEPT_MASK (0x20U)
#define SLEEPCON1_PRIVATE_TSTAT0_GPIO8_LPACCEPT_SHIFT (5U)
/*! GPIO8_LPACCEPT - GPIO8 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_GPIO8_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_GPIO8_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_GPIO8_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_GPIO9_LPACCEPT_MASK (0x40U)
#define SLEEPCON1_PRIVATE_TSTAT0_GPIO9_LPACCEPT_SHIFT (6U)
/*! GPIO9_LPACCEPT - GPIO Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_GPIO9_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_GPIO9_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_GPIO9_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_GPIO10_LPACCEPT_MASK (0x80U)
#define SLEEPCON1_PRIVATE_TSTAT0_GPIO10_LPACCEPT_SHIFT (7U)
/*! GPIO10_LPACCEPT - GPIO10 Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_GPIO10_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_GPIO10_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_GPIO10_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_I3C2_STOP_MASK  (0x100U)
#define SLEEPCON1_PRIVATE_TSTAT0_I3C2_STOP_SHIFT (8U)
/*! I3C2_STOP - I3C2 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON1_PRIVATE_TSTAT0_I3C2_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_I3C2_STOP_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_I3C2_STOP_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_I3C3_STOP_MASK  (0x200U)
#define SLEEPCON1_PRIVATE_TSTAT0_I3C3_STOP_SHIFT (9U)
/*! I3C3_STOP - I3C3 Stop Status
 *  0b0..Not in Stop status
 *  0b1..In Stop status
 */
#define SLEEPCON1_PRIVATE_TSTAT0_I3C3_STOP(x)    (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_I3C3_STOP_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_I3C3_STOP_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_F_LPACCEPT_MASK (0x10000U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_F_LPACCEPT_SHIFT (16U)
/*! LP_FLEXCOMM17_F_LPACCEPT - LP_FLEXCOMM17 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_F_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM17_F_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_F_LPACCEPT_MASK (0x20000U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_F_LPACCEPT_SHIFT (17U)
/*! LP_FLEXCOMM18_F_LPACCEPT - LP_FLEXCOMM18 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_F_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM18_F_LPACCEPT_MASK)

#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_F_LPACCEPT_MASK (0x40000U)
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_F_LPACCEPT_SHIFT (18U)
/*! LP_FLEXCOMM19_F_LPACCEPT - LP_FLEXCOMM19 Function Low-power Accept Status
 *  0b0..Not accept
 *  0b1..Accept
 */
#define SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_F_LPACCEPT(x) (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_F_LPACCEPT_SHIFT)) & SLEEPCON1_PRIVATE_TSTAT0_LP_FLEXCOMM19_F_LPACCEPT_MASK)

