nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
/*! @name DSPSTALL - HiFi1 DSP Stall */
/*! @{ */

#define SYSCON1_DSPSTALL_DSPSTALL_MASK           (0x1U)
#define SYSCON1_DSPSTALL_DSPSTALL_SHIFT          (0U)
/*! DSPSTALL - Run/Stall Control
 *  0b0..Run (normal mode)
 *  0b1..Stall mode
 */
#define SYSCON1_DSPSTALL_DSPSTALL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON1_DSPSTALL_DSPSTALL_SHIFT)) & SYSCON1_DSPSTALL_DSPSTALL_MASK)
/*! @} */

/*! @name OCDHALTONRESET - HiFi1 OCDHaltOnReset */
/*! @{ */

#define SYSCON1_OCDHALTONRESET_OCDHALTONRESET_MASK (0x1U)
#define SYSCON1_OCDHALTONRESET_OCDHALTONRESET_SHIFT (0U)
/*! OCDHALTONRESET - OCDHaltOnReset
 *  0b0..Allow normal operation when HiFi1 exits reset (starts fetching and executing instructions from memory)
 *  0b1..Force HiFi1 to enter OCD Halt mode when HiFi1 exits reset
 */
#define SYSCON1_OCDHALTONRESET_OCDHALTONRESET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_OCDHALTONRESET_OCDHALTONRESET_SHIFT)) & SYSCON1_OCDHALTONRESET_OCDHALTONRESET_MASK)
/*! @} */

/*! @name HIFI1_GPR0 - HiFi1 General Purpose Register 0 */
/*! @{ */

#define SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_MASK    (0x1U)
#define SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_SHIFT   (0U)
/*! PFAULTINFOVLD - PFaultInfoValid
 *  0b1..Asserted
 *  0b0..Not asserted
 */
#define SYSCON1_HIFI1_GPR0_PFAULTINFOVLD(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_SHIFT)) & SYSCON1_HIFI1_GPR0_PFAULTINFOVLD_MASK)

#define SYSCON1_HIFI1_GPR0_PFATALERR_MASK        (0x2U)
#define SYSCON1_HIFI1_GPR0_PFATALERR_SHIFT       (1U)
/*! PFATALERR - PFatalError
 *  0b1..Error occurs
 *  0b0..No error occurs
 */
#define SYSCON1_HIFI1_GPR0_PFATALERR(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR0_PFATALERR_SHIFT)) & SYSCON1_HIFI1_GPR0_PFATALERR_MASK)

#define SYSCON1_HIFI1_GPR0_EXCEPTIONERR_MASK     (0x4U)
#define SYSCON1_HIFI1_GPR0_EXCEPTIONERR_SHIFT    (2U)
/*! EXCEPTIONERR - DoubleExceptionError
 *  0b1..Error occurs
 *  0b0..No error occurs
 */
#define SYSCON1_HIFI1_GPR0_EXCEPTIONERR(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR0_EXCEPTIONERR_SHIFT)) & SYSCON1_HIFI1_GPR0_EXCEPTIONERR_MASK)
/*! @} */

/*! @name HIFI1_GPR1 - HiFi1 General Purpose Register 1 */
/*! @{ */

#define SYSCON1_HIFI1_GPR1_PFAULTINFO_MASK       (0xFFFFFFFFU)
#define SYSCON1_HIFI1_GPR1_PFAULTINFO_SHIFT      (0U)
/*! PFAULTINFO - PFaultInfo */
#define SYSCON1_HIFI1_GPR1_PFAULTINFO(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR1_PFAULTINFO_SHIFT)) & SYSCON1_HIFI1_GPR1_PFAULTINFO_MASK)
/*! @} */

/*! @name HIFI1_GPR2 - HiFi1 General Purpose Register 2 */
/*! @{ */

#define SYSCON1_HIFI1_GPR2_EXPSTATE_MASK         (0xFFFFFFFFU)
#define SYSCON1_HIFI1_GPR2_EXPSTATE_SHIFT        (0U)
/*! EXPSTATE - GPIO32 Option TIE Output State */
#define SYSCON1_HIFI1_GPR2_EXPSTATE(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON1_HIFI1_GPR2_EXPSTATE_SHIFT)) & SYSCON1_HIFI1_GPR2_EXPSTATE_MASK)
/*! @} */

/*! @name DSP_VECT_REMAP - HiFi1 DSP Vector Remap */
/*! @{ */

#define SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_MASK (0xFFFU)
#define SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_SHIFT (0U)
/*! DSP_VECT_REMAP - DSP Vector Remap */
#define SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_SHIFT)) & SYSCON1_DSP_VECT_REMAP_DSP_VECT_REMAP_MASK)

#define SYSCON1_DSP_VECT_REMAP_STATVECSELECT_MASK (0x1000U)
#define SYSCON1_DSP_VECT_REMAP_STATVECSELECT_SHIFT (12U)
/*! STATVECSELECT - Static Vector Select
 *  0b0..0058_0000h to another address in RAM0
 *  0b1..0060_0000h to another address in RAM1
 */
#define SYSCON1_DSP_VECT_REMAP_STATVECSELECT(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON1_DSP_VECT_REMAP_STATVECSELECT_SHIFT)) & SYSCON1_DSP_VECT_REMAP_STATVECSELECT_MASK)
/*! @} */

/*! @name EDMA2_EN0 - eDMA2 Request Enable 0 */
/*! @{ */

#define SYSCON1_EDMA2_EN0_MICFIL_EN_MASK         (0x2U)
#define SYSCON1_EDMA2_EN0_MICFIL_EN_SHIFT        (1U)
/*! MICFIL_EN - MICFIL Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_MICFIL_EN(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_MICFIL_EN_SHIFT)) & SYSCON1_EDMA2_EN0_MICFIL_EN_MASK)

#define SYSCON1_EDMA2_EN0_XSPI2_RX_EN_MASK       (0x4U)
#define SYSCON1_EDMA2_EN0_XSPI2_RX_EN_SHIFT      (2U)
/*! XSPI2_RX_EN - XSPI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_XSPI2_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_XSPI2_RX_EN_SHIFT)) & SYSCON1_EDMA2_EN0_XSPI2_RX_EN_MASK)

#define SYSCON1_EDMA2_EN0_XSPI2_TX_EN_MASK       (0x8U)
#define SYSCON1_EDMA2_EN0_XSPI2_TX_EN_SHIFT      (3U)
/*! XSPI2_TX_EN - XSPI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_XSPI2_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_XSPI2_TX_EN_SHIFT)) & SYSCON1_EDMA2_EN0_XSPI2_TX_EN_MASK)

#define SYSCON1_EDMA2_EN0_PINT1_IRQ0_EN_MASK     (0x10U)
#define SYSCON1_EDMA2_EN0_PINT1_IRQ0_EN_SHIFT    (4U)
/*! PINT1_IRQ0_EN - PINT1 Interrupt 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_PINT1_IRQ0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_PINT1_IRQ0_EN_SHIFT)) & SYSCON1_EDMA2_EN0_PINT1_IRQ0_EN_MASK)

#define SYSCON1_EDMA2_EN0_PINT1_IRQ1_EN_MASK     (0x20U)
#define SYSCON1_EDMA2_EN0_PINT1_IRQ1_EN_SHIFT    (5U)
/*! PINT1_IRQ1_EN - PINT1 Interrupt 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_PINT1_IRQ1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_PINT1_IRQ1_EN_SHIFT)) & SYSCON1_EDMA2_EN0_PINT1_IRQ1_EN_MASK)

#define SYSCON1_EDMA2_EN0_PINT1_IRQ2_EN_MASK     (0x40U)
#define SYSCON1_EDMA2_EN0_PINT1_IRQ2_EN_SHIFT    (6U)
/*! PINT1_IRQ2_EN - PINT1 Interrupt 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_PINT1_IRQ2_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_PINT1_IRQ2_EN_SHIFT)) & SYSCON1_EDMA2_EN0_PINT1_IRQ2_EN_MASK)

#define SYSCON1_EDMA2_EN0_PINT1_IRQ3_EN_MASK     (0x80U)
#define SYSCON1_EDMA2_EN0_PINT1_IRQ3_EN_SHIFT    (7U)
/*! PINT1_IRQ3_EN - PINT1 Interrupt 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA2_EN0_PINT1_IRQ3_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA2_EN0_PINT1_IRQ3_EN_SHIFT)) & SYSCON1_EDMA2_EN0_PINT1_IRQ3_EN_MASK)

