nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_MASK    (0x20000U)
#define SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_SHIFT   (17U)
/*! RGPI10_DMA0_EN - GPIO10 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_SHIFT)) & SYSCON1_EDMA3_EN1_RGPI10_DMA0_EN_MASK)

#define SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_MASK    (0x40000U)
#define SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_SHIFT   (18U)
/*! RGPI10_DMA1_EN - GPIO10 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_SHIFT)) & SYSCON1_EDMA3_EN1_RGPI10_DMA1_EN_MASK)

#define SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_MASK     (0x80000U)
#define SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_SHIFT    (19U)
/*! LPI2C15_RX_EN - LPI2C15 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LPI2C15_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LPI2C15_RX_EN_MASK)

#define SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_MASK     (0x100000U)
#define SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_SHIFT    (20U)
/*! LPI2C15_TX_EN - LPI2C15 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON1_EDMA3_EN1_LPI2C15_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_SHIFT)) & SYSCON1_EDMA3_EN1_LPI2C15_TX_EN_MASK)
/*! @} */

/*! @name I3C_ASYNC_WAKEUP_CTRL - I3C Asynchronous Wake-up Control */
/*! @{ */

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_MASK (0x1U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_SHIFT (0U)
/*! I3C2_ON_CHIP_STRONG_PULL_DIS - I3C2 On-Chip Strong Pull Disable
 *  0b0..Enables
 *  0b1..Disables
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C2_ON_CHIP_STRONG_PULL_DIS_MASK)

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_MASK (0x2U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_SHIFT (1U)
/*! IRQ_EN2 - I3C2 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN2_MASK)

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_MASK (0x100U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_SHIFT (8U)
/*! I3C3_ON_CHIP_STRONG_PULL_DIS - I3C3 On-Chip Strong Pull Disable
 *  0b0..Enables
 *  0b1..Disables
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_I3C3_ON_CHIP_STRONG_PULL_DIS_MASK)

#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_MASK (0x200U)
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_SHIFT (9U)
/*! IRQ_EN3 - I3C3 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3(x) (((uint32_t)(((uint32_t)(x)) << SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_SHIFT)) & SYSCON1_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SYSCON1_Register_Masks */


/* SYSCON1 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON1 base address */
  #define SYSCON1_BASE                             (0x50042000u)
  /** Peripheral SYSCON1 base address */
  #define SYSCON1_BASE_NS                          (0x40042000u)
  /** Peripheral SYSCON1 base pointer */
  #define SYSCON1                                  ((SYSCON1_Type *)SYSCON1_BASE)
  /** Peripheral SYSCON1 base pointer */
  #define SYSCON1_NS                               ((SYSCON1_Type *)SYSCON1_BASE_NS)
  /** Array initializer of SYSCON1 peripheral base addresses */
  #define SYSCON1_BASE_ADDRS                       { SYSCON1_BASE }
  /** Array initializer of SYSCON1 peripheral base pointers */
  #define SYSCON1_BASE_PTRS                        { SYSCON1 }
  /** Array initializer of SYSCON1 peripheral base addresses */
  #define SYSCON1_BASE_ADDRS_NS                    { SYSCON1_BASE_NS }
  /** Array initializer of SYSCON1 peripheral base pointers */
  #define SYSCON1_BASE_PTRS_NS                     { SYSCON1_NS }
#else
  /** Peripheral SYSCON1 base address */
  #define SYSCON1_BASE                             (0x40042000u)
  /** Peripheral SYSCON1 base pointer */
  #define SYSCON1                                  ((SYSCON1_Type *)SYSCON1_BASE)
  /** Array initializer of SYSCON1 peripheral base addresses */
  #define SYSCON1_BASE_ADDRS                       { SYSCON1_BASE }
  /** Array initializer of SYSCON1 peripheral base pointers */
  #define SYSCON1_BASE_PTRS                        { SYSCON1 }
#endif

/*!
 * @}
 */ /* end of group SYSCON1_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SYSCON2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON2_Peripheral_Access_Layer SYSCON2 Peripheral Access Layer
 * @{
 */

/** SYSCON2 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4064];
  __IO uint32_t GPR[2];                            /**< General Purpose Register 0..General Purpose Register 1, array offset: 0xFE0, array step: 0x4 */
} SYSCON2_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON2_Register_Masks SYSCON2 Register Masks
 * @{
 */

/*! @name GPR - General Purpose Register 0..General Purpose Register 1 */
/*! @{ */

#define SYSCON2_GPR_GPR_MASK                     (0xFFFFFFFFU)
#define SYSCON2_GPR_GPR_SHIFT                    (0U)
/*! GPR - General Purpose Register Bits */
#define SYSCON2_GPR_GPR(x)                       (((uint32_t)(((uint32_t)(x)) << SYSCON2_GPR_GPR_SHIFT)) & SYSCON2_GPR_GPR_MASK)
/*! @} */

/* The count of SYSCON2_GPR */
#define SYSCON2_GPR_COUNT                        (2U)


/*!
 * @}
 */ /* end of group SYSCON2_Register_Masks */


/* SYSCON2 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SYSCON2 base address */
  #define SYSCON2_BASE                             (0x50066000u)
  /** Peripheral SYSCON2 base address */
  #define SYSCON2_BASE_NS                          (0x40066000u)
  /** Peripheral SYSCON2 base pointer */
  #define SYSCON2                                  ((SYSCON2_Type *)SYSCON2_BASE)
  /** Peripheral SYSCON2 base pointer */
  #define SYSCON2_NS                               ((SYSCON2_Type *)SYSCON2_BASE_NS)
  /** Array initializer of SYSCON2 peripheral base addresses */
  #define SYSCON2_BASE_ADDRS                       { SYSCON2_BASE }
  /** Array initializer of SYSCON2 peripheral base pointers */
  #define SYSCON2_BASE_PTRS                        { SYSCON2 }
  /** Array initializer of SYSCON2 peripheral base addresses */
  #define SYSCON2_BASE_ADDRS_NS                    { SYSCON2_BASE_NS }
  /** Array initializer of SYSCON2 peripheral base pointers */
  #define SYSCON2_BASE_PTRS_NS                     { SYSCON2_NS }
#else
  /** Peripheral SYSCON2 base address */
  #define SYSCON2_BASE                             (0x40066000u)
  /** Peripheral SYSCON2 base pointer */
  #define SYSCON2                                  ((SYSCON2_Type *)SYSCON2_BASE)
  /** Array initializer of SYSCON2 peripheral base addresses */
  #define SYSCON2_BASE_ADDRS                       { SYSCON2_BASE }
  /** Array initializer of SYSCON2 peripheral base pointers */
  #define SYSCON2_BASE_PTRS                        { SYSCON2 }
#endif

/*!
 * @}
 */ /* end of group SYSCON2_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SYSCON3 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON3_Peripheral_Access_Layer SYSCON3 Peripheral Access Layer
 * @{
 */

