nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/MIMXRT735S_hifi1.h
#define XSPI_MCR_END_CFG_MASK                    (0xCU)
#define XSPI_MCR_END_CFG_SHIFT                   (2U)
/*! END_CFG - Byte Order
 *  0b00..64-bit BE
 *  0b01..32-bit LE
 *  0b10..32-bit BE
 *  0b11..64-bit LE
 */
#define XSPI_MCR_END_CFG(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_END_CFG_SHIFT)) & XSPI_MCR_END_CFG_MASK)

#define XSPI_MCR_DQS_OUT_EN_MASK                 (0x10U)
#define XSPI_MCR_DQS_OUT_EN_SHIFT                (4U)
/*! DQS_OUT_EN - DQS Output Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_MCR_DQS_OUT_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_OUT_EN_SHIFT)) & XSPI_MCR_DQS_OUT_EN_MASK)

#define XSPI_MCR_DQS_LAT_EN_MASK                 (0x20U)
#define XSPI_MCR_DQS_LAT_EN_SHIFT                (5U)
/*! DQS_LAT_EN - DQS Latency Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_MCR_DQS_LAT_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_LAT_EN_SHIFT)) & XSPI_MCR_DQS_LAT_EN_MASK)

#define XSPI_MCR_DQS_EN_MASK                     (0x40U)
#define XSPI_MCR_DQS_EN_SHIFT                    (6U)
/*! DQS_EN - DQS Enable
 *  0b0..Reserved
 *  0b1..Enables
 */
#define XSPI_MCR_DQS_EN(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_EN_SHIFT)) & XSPI_MCR_DQS_EN_MASK)

#define XSPI_MCR_DDR_EN_MASK                     (0x80U)
#define XSPI_MCR_DDR_EN_SHIFT                    (7U)
/*! DDR_EN - DDR Mode Enable
 *  0b0..2x clock disabled. Only SDR instructions processed
 *  0b1..2x clock enabled. Both SDR and DDR instructions processed
 */
#define XSPI_MCR_DDR_EN(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DDR_EN_SHIFT)) & XSPI_MCR_DDR_EN_MASK)

#define XSPI_MCR_VAR_LAT_EN_MASK                 (0x100U)
#define XSPI_MCR_VAR_LAT_EN_SHIFT                (8U)
/*! VAR_LAT_EN - Variable Latency Enable
 *  0b0..Fixed latency
 *  0b1..Additional initial latency
 */
#define XSPI_MCR_VAR_LAT_EN(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_VAR_LAT_EN_SHIFT)) & XSPI_MCR_VAR_LAT_EN_MASK)

#define XSPI_MCR_IPS_TG_RST_MASK                 (0x200U)
#define XSPI_MCR_IPS_TG_RST_SHIFT                (9U)
/*! IPS_TG_RST - Software Reset for IPS Target Group Queue
 *  0b0..No action
 *  0b1..Resets
 *  0b0..No action
 *  0b1..Reset of IPS TG queue is in progress if is having TG Grant
 */
#define XSPI_MCR_IPS_TG_RST(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_IPS_TG_RST_SHIFT)) & XSPI_MCR_IPS_TG_RST_MASK)

#define XSPI_MCR_CLR_RXF_MASK                    (0x400U)
#define XSPI_MCR_CLR_RXF_SHIFT                   (10U)
/*! CLR_RXF - Clear RX FIFO
 *  0b0..No action. Always reads 0.
 *  0b1..Clears buffer and returns pointers to 0
 */
#define XSPI_MCR_CLR_RXF(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_CLR_RXF_SHIFT)) & XSPI_MCR_CLR_RXF_MASK)

#define XSPI_MCR_CLR_TXF_MASK                    (0x800U)
#define XSPI_MCR_CLR_TXF_SHIFT                   (11U)
/*! CLR_TXF - Clear TX FIFO
 *  0b0..No action. Always reads 0.
 *  0b1..Clears buffer and returns pointers to 0
 */
#define XSPI_MCR_CLR_TXF(x)                      (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_CLR_TXF_SHIFT)) & XSPI_MCR_CLR_TXF_MASK)

#define XSPI_MCR_DLPEN_MASK                      (0x1000U)
#define XSPI_MCR_DLPEN_SHIFT                     (12U)
/*! DLPEN - Data Learning Pattern Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_MCR_DLPEN(x)                        (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DLPEN_SHIFT)) & XSPI_MCR_DLPEN_MASK)

#define XSPI_MCR_MDIS_MASK                       (0x4000U)
#define XSPI_MCR_MDIS_SHIFT                      (14U)
/*! MDIS - Module Disable
 *  0b0..Enables clocks
 *  0b1..Allows external logic to disable clocks
 */
#define XSPI_MCR_MDIS(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_MDIS_SHIFT)) & XSPI_MCR_MDIS_MASK)

#define XSPI_MCR_DOZE_MASK                       (0x8000U)
#define XSPI_MCR_DOZE_SHIFT                      (15U)
/*! DOZE - Doze Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_MCR_DOZE(x)                         (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DOZE_SHIFT)) & XSPI_MCR_DOZE_MASK)

#define XSPI_MCR_ISD2FA_MASK                     (0x10000U)
#define XSPI_MCR_ISD2FA_SHIFT                    (16U)
/*! ISD2FA - Idle Signal Drive IOFA[2] Flash Memory A
 *  0b0..Logic low
 *  0b1..Logic high
 */
#define XSPI_MCR_ISD2FA(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_ISD2FA_SHIFT)) & XSPI_MCR_ISD2FA_MASK)

#define XSPI_MCR_ISD3FA_MASK                     (0x20000U)
#define XSPI_MCR_ISD3FA_SHIFT                    (17U)
/*! ISD3FA - Idle Signal Drive IOFA[3] Flash Memory A
 *  0b0..Logic low
 *  0b1..Logic high
 */
#define XSPI_MCR_ISD3FA(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_ISD3FA_SHIFT)) & XSPI_MCR_ISD3FA_MASK)

#define XSPI_MCR_X16_DB_CA_EN_MASK               (0x100000U)
#define XSPI_MCR_X16_DB_CA_EN_SHIFT              (20U)
/*! X16_DB_CA_EN - X16 Databus Enable
 *  0b0..Data only
 *  0b1..Address and command information along with data
 */
#define XSPI_MCR_X16_DB_CA_EN(x)                 (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_X16_DB_CA_EN_SHIFT)) & XSPI_MCR_X16_DB_CA_EN_MASK)

#define XSPI_MCR_X16_EN_MASK                     (0x200000U)
#define XSPI_MCR_X16_EN_SHIFT                    (21U)
/*! X16_EN - X16 Mode Enable
 *  0b0..Disables (x8, x4, x2, x1 modes remain enabled)
 *  0b1..Enables
 */
#define XSPI_MCR_X16_EN(x)                       (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_X16_EN_SHIFT)) & XSPI_MCR_X16_EN_MASK)

#define XSPI_MCR_DQS_FA_SEL_MASK                 (0x3000000U)
#define XSPI_MCR_DQS_FA_SEL_SHIFT                (24U)
/*! DQS_FA_SEL - DQS Clock For Sampling Read Data Flash Memory A
 *  0b00..
 *  0b01..Dummy pad loopback
 *  0b10..DQS pad loopback
 *  0b11..External DQS
 */
#define XSPI_MCR_DQS_FA_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_DQS_FA_SEL_SHIFT)) & XSPI_MCR_DQS_FA_SEL_MASK)

#define XSPI_MCR_CKN_FA_EN_MASK                  (0x4000000U)
#define XSPI_MCR_CKN_FA_EN_SHIFT                 (26U)
/*! CKN_FA_EN - CKN Pad For Flash Memory A
 *  0b0..Disables
 *  0b1..Enables
 */
#define XSPI_MCR_CKN_FA_EN(x)                    (((uint32_t)(((uint32_t)(x)) << XSPI_MCR_CKN_FA_EN_SHIFT)) & XSPI_MCR_CKN_FA_EN_MASK)
/*! @} */

